print('hello world!')

#* Выведите строку со своим именем в консоль.

print('Maksim')

#* Выведите любое произвольное число в консоль.

print(42)

#* Выведите в консоль принципы философии Python.

# import this

# test = 'abc'

some_str = 'abc'

some_num = 646576

#* Выведите в консоль переменные, придуманные вами в прошлом уроке.

print(some_str, some_num)

#* Выведите в консоль сумму трех чисел 1, 2 и 3.

print(1 + 2 + 3)    #* Сумма трех чисел 1, 2 и 3.

#* Пусть у вас есть числа 4 и 6. Отнимите от второго числа первое.

print(6 - 4) #* Ответ: 2

#* Найдите произведение двух чисел из предыдущей задачи.

print(6 * 4) #* Ответ: 24

#* Пусть у вас есть числа 8 и 3. Разделите первое число на второе.

# print(8 / 3)

#* Измените решение предыдущей задачи так, чтобы после деления не было остатка.

print(8 / 2)

# *Даны два числа:

num1 = 5
num2 = 3
# *Найдите сумму этих чисел.

print(num1 + num2)

#* Даны два числа:

num1 = 10
num2 = 6
#* Найдите разность этих чисел.

res = num1 - num2
print(res)

#* Даны два числа:

num1 = 7
num2 = 3
# *Найдите произведение этих чисел.

print(num1 * num2)

#* Даны два числа:

num1 = 15
num2 = 6
#* Найдите частное этих чисел.

print(num1 / num2)

# *Измените решение предыдущей задачи так, чтобы при делении частное получилось без остатка.

num2 = 5
res = num1 / num2
print(res)

# *Переделайте этот код так, чтобы в нем были операции инкремента и декремента:

num = 4
num += 1
num -= 1
num += 1
print(num)

# *Даны следующие числа:

num1 = 200 ** 500
num2 = 3000
# *Получите их произведение.

print(num1 * num2)

#* Даны следующие числа:

num1 = 67 ** 50
num2 = 45 ** 60
# *Отнимите от первого числа второе.

print(num1 - num2)

# *Запишите в переменную num1 число 1.5, а в переменную num2 - число 0.75. Найдите сумму значений этих переменных и выведите ее в консоль.

num1 = 1.5
num2 = 0.75

res = num1 + num2

print(res)

# *Дан следующие числа:

num1 = 3.4
num2 = 8.27
num3 = 1.5
# *Отнимите от второго числа первое, а затем умножьте результат на третье число.

print((num2 - num1) *  num3)

# *Создайте переменную test со значением -100. Выведите это значение в консоль.

test = -100
print(test)

# *Создайте переменную test, запишите в нее какое-нибудь положительное или отрицательное число. Выведите в консоль это число с обратным знаком.

test = -100
print(-test)

# *Пусть у вас есть переменная test с отрицательным числом. Отнимите от нее -20. Выведите полученный результат в консоль.

print(test - 20)

# *Даны два числа:

num1 = 13
num2 = 3
# *Найдите остаток от деления первого числа на второе.

print(num1 % num2)

# *Даны два числа:

num1 = 26
num2 = 8
# *Найдите остаток от деления первого числа на второе.

print(num1 % num2)

#* Даны два числа:

num1 = -5
num2 = 12
#* Найдите остаток от деления второго числа на первое.

print(num2 % num1)

# *Даны два числа:

num1 = 2
num2 = 5
# *Возведите первое число в степень второго числа.

res = num1 ** num2
print(res)

# *Даны два числа:

num1 = 1
num2 = 3
# *Возведите число 5 в степень, равную сумме этих двух чисел.

print(5 ** (num1 + num2))

# *Даны две строки:

txt1 = 'abc'
txt2 = 'def'
# *Слейте эти строки в одну новую и выведите на экран.

print(txt1 + txt2)

# *Даны следующие строки:

txt1 = '12'
txt2 = '+'
txt3 = '5'
txt4 = '17'
# *Слейте эти строки в одну новую и выведите на экран.

print(txt1 + txt2 + txt3 + txt4)

# *Измените решение предыдущей задачи так, чтобы после слияния между третьей и четвертой строками находился оператор =.

print(txt1 + txt2 + txt3 + '=' + txt4)

# *Напишите как можно получить следующий результат:

# *'a1b2a1b2a1b2a1b2'

print(4 * 'a1b2')

# *Напишите как можно получить следующий результат:

# *'abab1213'

print(2 * 'ab' + '1213')

# *Дана строка:

txt = 'abcdef'
# *Выведите в консоль первый символ этой строки.

print(txt[0])

# *Дана строка:

txt = 'abcdef'
# *Выведите в консоль второй символ этой строки.

print(txt[1])

# Дана строка:

txt = 'abcdef'
# Выведите в консоль последний символ этой строки.

print(txt[-1])

# Дана строка:

txt = 'abcdef'
# Выведите в консоль предпоследний символ этой строки.

print(txt[-2])

# Дана следующая строка:

# *tst = "abcd"fr'23"
# Выведите ее в консоль без ошибок.

tst = "abcd\"fr\'23"

print(tst)

# Дана строка:

txt = 'abcdef'
# Выведите в консоль длину этой строки.

print(len(txt))

# Дана строка:

txt = 'ab cd ef'
# Выведите в консоль длину этой строки.

print(len(txt))

# Дана переменная:

txt = '''
    Kazlouski
    Maksim
    Vadzimavich
'''

# Запишите в эту переменную ваше имя, фамилию и отчество так, чтобы они были на разных строках.

print(txt)

# Присвойте переменной значение истина. Выведите эту переменную на экран.

test = True

print(test)

# Присвойте переменной значение ложь. Выведите эту переменную на экран.

test = False

print(test)

# Присвойте переменной значение None. Выведите эту переменную в консоль.

test = None
print(test)

# Даны переменные:

num1 = 1
num2 = 2
# Сложите эти переменные как строки:

# '12'
print(str(num1) + str(num2))

# Даны переменные:

tst1 = 'abc'
txt2 = 123
# Сложите эти переменные как строки:

# 'abc123'

print(tst1 + str(txt2))

# Дано число:

tst = 123
# Найдите количество цифр этого числа.

print(len(str(tst)))

# Дано число:

tst = 456
# Найдите сумму цифр этого числа.

test = str(tst)
one = test[0]
two = test[1]
three = test[2]

print(int(one) + int(two) + int(three))

# Дана переменная:

txt = '123'
# Преобразуйте значение переменной к целому числу.

print(int(txt))

# Даны переменные:

txt1 = '123'
txt2 = '456'
# Найдите сумму значений этих переменных.

print(int(txt1) + int(txt2))

# Дана строка '12345'. Найдите сумму цифр этой строки.

string = '12345'

print(int(string[0]) + int(string[1]) + int(string[2]) + int(string[3]) + int(len(string)))

# Дана строка '2489'. Отнимите от третьего символа второй, а затем умножьте результат на первый символ.

string = '2489'

print((int(string[2]) - int(string[1])) * int(string[0]))

# Дано число:

tst = 123
# Найдите сумму цифр этого числа.

text = str(tst)

print(int(text[0]) + int(text[1]) + int(text[2]))

# Дано число:

tst = 4567
# Сложите первые две цифры. А затем от получившегося результата отнимите последнюю цифру числа 4567.

text = str(tst)

print((int(text[0]) + int(text[1])) - int(text[3]))

# Даны переменные:

tst1 = '1.1'
tst2 = '1.2'
# Найдите сумму значений этих переменных.

print(float(tst1) + float(tst2))

# Даны переменные:

tst1 = 2
tst2 = 4
# Преобразуйте их числа с плавающей точкой и найдите их разность.

print(float(tst1) - float(tst2))

# Попросите у пользователя ввести текущий день недели. Выведите его в консоль.

test = input('day of week?')

print(test)

# Пусть есть две переменные:

num1 = 10
num2 = input('enter number: ')
# Получите их сумму и выведите ее в консоль.

print(num1 + int(num2))