print('hello world!')

#* Выведите строку со своим именем в консоль.

print('Maksim')

#* Выведите любое произвольное число в консоль.

print(42)

#* Выведите в консоль принципы философии Python.

# import this

# test = 'abc'

some_str = 'abc'

some_num = 646576

#* Выведите в консоль переменные, придуманные вами в прошлом уроке.

print(some_str, some_num)

#* Выведите в консоль сумму трех чисел 1, 2 и 3.

print(1 + 2 + 3)    #* Сумма трех чисел 1, 2 и 3.

#* Пусть у вас есть числа 4 и 6. Отнимите от второго числа первое.

print(6 - 4) #* Ответ: 2

#* Найдите произведение двух чисел из предыдущей задачи.

print(6 * 4) #* Ответ: 24